[
  {
    "id": 1,
    "title": "The Crossing",
    "publishDate": "2024-01-15",
    "wordCount": 2450,
    "content": "The rain hadn't stopped for three days.\n\nDetective Sarah Cross stood at the edge of the crime scene, watching the water pool around the chalk outline that had already begun to dissolve. The body was gone—taken to the morgue hours ago—but something lingered. Something that made the hair on her neck stand up despite the humid air.\n\n\"You feel it too, don't you?\"\n\nShe turned to find Marcus leaning against his sedan, cigarette smoke mixing with the mist. He wasn't supposed to be here. Technically, he wasn't even supposed to exist in official records anymore.\n\n\"Feel what?\" Sarah asked, though she knew exactly what he meant.\n\n\"The threshold. It's thin here. Thinner than usual.\" He flicked ash onto the wet pavement. \"How many does this make? Seven?\"\n\n\"Nine,\" she corrected. \"Nine in two months.\"\n\nMarcus pushed off from the car and walked toward her, his footsteps silent despite the puddles. That was one of the things about him that still unnerved her, even after six months of partnership. The way he moved like a shadow, there but not quite solid.\n\n\"They're accelerating,\" he said. \"Whatever's doing this, it's getting bolder.\"\n\nSarah pulled her jacket tighter. The cold had nothing to do with the weather. \"The captain wants answers. Real answers. Not the kind that end up in X-Files reruns.\"\n\n\"Then maybe it's time you told him the truth.\"\n\n\"Which truth would that be? That monsters are real? That there's a whole world hiding just behind ours, waiting to tear through? That I've been working with a dead man for half a year?\"\n\nMarcus smiled, but it didn't reach his eyes. It never did. \"All of the above?\"\n\nShe turned back to the crime scene. The tape fluttered in the wind, yellow against the gray morning. Somewhere in this city, something was hunting. Something that had crossed over from the other side. And if they didn't stop it soon, nine victims would become ninety.\n\n\"We need to find where it's coming through,\" Sarah said. \"The entry point. Every creature leaves a trail back to its threshold.\"\n\n\"I know a place we can start,\" Marcus said. \"But you're not going to like it.\"\n\n\"I haven't liked anything about this job since the day you showed up in my apartment and proved that death isn't the end.\"\n\n\"Welcome to the real world, Detective. Population: complicated.\"\n\nAs they walked back to their cars, Sarah noticed the rain had finally stopped. But the feeling of being watched hadn't. She glanced up at the surrounding buildings, their windows dark and empty. Somewhere up there, or maybe in the alley behind them, or perhaps in that moment existing in multiple places at once, something was observing.\n\nHunting.\n\nWaiting for the next threshold to open.\n\nAnd Sarah Cross, for the first time in her career, wasn't sure if she was the hunter or the prey."
  },
  {
    "id": 2,
    "title": "Echoes in the Dark",
    "publishDate": "2024-01-22",
    "wordCount": 2680,
    "content": "The nightclub called Liminal was exactly the kind of place Sarah had learned to avoid.\n\nNeon signs buzzed with an electric hum that seemed to vibrate in her teeth, casting shadows that moved wrong—too fast, too slow, sometimes not at all when they should have. The bass from inside was less heard than felt, a pulse that matched something primal and ancient.\n\n\"This is where you're getting your information?\" Sarah asked, eyeing the line of people waiting to get in. They looked normal enough, but she'd learned that appearances meant nothing anymore.\n\nMarcus nodded. \"The owner, Dante, runs a neutral zone. Creatures from both sides can meet here without conflict. Switzerland, but with better drinks and worse music.\"\n\n\"Creatures,\" Sarah repeated, the word still strange in her mouth despite everything she'd seen.\n\n\"You'll get used to it.\"\n\n\"That's what I'm afraid of.\"\n\nThey bypassed the line, Marcus exchanging a nod with the bouncer—a woman who stood seven feet tall with arms covered in tattoos that seemed to shift when Sarah wasn't looking directly at them. The bouncer's eyes flashed yellow for just a moment before she unhooked the velvet rope.\n\nInside, the club was a sensory assault. Lights strobed in colors that shouldn't exist, music thundered from speakers that vibrated the air itself, and the crowd moved like a living organism, pressing and flowing in patterns that made Sarah's detective instincts scream.\n\nBut it was the people—if they could all be called that—that made her hand drift toward her weapon.\n\nA man at the bar had no shadow. A woman on the dance floor flickered in and out of phase with reality. Two figures in a corner booth seemed to share the same space, occupying it simultaneously without touching.\n\n\"Don't stare,\" Marcus warned, guiding her through the crowd. \"Most of them are harmless. They just want to exist without being hunted.\"\n\n\"And the ones who aren't harmless?\"\n\n\"That's why we're here.\"\n\nThey descended a staircase that seemed to go down too far for the building's footprint, emerging into a quieter lounge area. Here, the music was muted, the lights soft and amber. It felt almost normal except for the way the walls seemed to breathe.\n\nDante sat in a booth at the back, a glass of something that glowed faintly blue in front of him. He was handsome in a way that made Sarah immediately suspicious—too perfect, too symmetrical, like an AI's rendering of human beauty.\n\n\"Marcus,\" Dante said, his voice smooth as silk. \"Still among the living dead, I see.\"\n\n\"Still among the living,\" Marcus corrected. \"Mostly.\"\n\nDante's eyes shifted to Sarah. \"And you brought a cop. How… bold.\"\n\n\"Detective Cross,\" Sarah introduced herself. \"We need information about the killings.\"\n\n\"Ah yes, the rifts.\" Dante swirled his drink. \"Someone's been very naughty, tearing holes between worlds without permission. Bad for business when your clientele starts getting hunted.\"\n\n\"So you know what's doing it,\" Marcus said, sliding into the booth.\n\nSarah remained standing, ready to move if needed.\n\n\"I know what, yes. Who is more complicated.\" Dante leaned forward. \"There's a summoner. Someone with enough power and knowledge to force thresholds open. They're calling something through. Something old and hungry.\"\n\n\"A name,\" Sarah demanded.\n\n\"Names have power, Detective. Especially in our world. But I can tell you where they'll strike next.\" He pulled out a phone—incongruously modern—and slid it across the table. On the screen was a map marked with locations.\n\n\"The pattern is obvious once you know what to look for,\" Dante continued. \"They're creating a ritual circle across the city. Nine points. You've found nine bodies, yes?\"\n\nSarah's blood ran cold. \"They're building something.\"\n\n\"A permanent threshold. A gate that stays open.\" Dante's expression was grim. \"If they complete it, this city becomes a hunting ground. Your world and the other side merge, just a little. Just enough.\"\n\n\"When?\" Marcus asked.\n\n\"The next new moon. Three days.\"\n\nSarah studied the map. The pattern was indeed there, once you knew to look for it—a geometric design that spanned miles. And there were two points left unmarked.\n\n\"We stop them before they finish,\" she said.\n\n\"Easy to say,\" Dante replied. \"But you're hunting someone who's already walked between worlds. Someone who's seen what lurks in the spaces between spaces and came back wanting more.\"\n\n\"Someone like Marcus,\" Sarah said quietly.\n\nThe silence that followed was heavy.\n\n\"Not like me,\" Marcus finally said. \"I came back because I had unfinished business. Whoever this is, they're not trying to return. They're trying to bring something back with them. Something that should stay buried in the dark.\"\n\nDante stood, buttoning his jacket. \"Then I suggest you work quickly, Detective. Because once that gate opens, even I can't protect you. And I've survived three apocalypses.\"\n\nAs they left the club, Sarah's phone buzzed. A text from the precinct: another body found. She checked the location.\n\nIt matched one of the two remaining points on Dante's map.\n\n\"We're too late,\" she said, showing Marcus the message.\n\nHe looked at the screen, then up at the night sky. The moon was already beginning to wane.\n\n\"Not too late,\" he said. \"But close. Very, very close.\"\n\nAbove them, the stars seemed to flicker, like lights seen through water. Or like they were being watched from somewhere far away.\n\nOr very, very near."
  },
  {
    "id": 3,
    "title": "Between Worlds",
    "publishDate": "2024-01-29",
    "wordCount": 2890,
    "content": "Coming soon..."
  }
]
